InformationRegisters/НастройкиИнтеграцииСБухгалтерией.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииСБухгалтерией</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОбласти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НастройкиОтраженияДокументовВБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>НастройкиОтраженияДокументовВБухгалтерии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияДанныхЧерезУниверсальныйФормат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОтражения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражениеВключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОбновленияУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательДляИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазделыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазделУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СовместноеИспользованиеИнтеграция/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция НовоеПодключениеКСервису(Пользователь = Неопределено, Таймаут = 60) Экспорт
	
	НастройкиПодключения = НастройкиПодключения(Пользователь);
	Если НастройкиПодключения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеПодключения = Новый Структура;
	ОписаниеПодключения.Вставить("Соединение", Неопределено);
	ОписаниеПодключения.Вставить("БазовыйURI", "");
	ОписаниеПодключения.Вставить("СтрокаАутентификации", "");
	ОписаниеПодключения.Вставить("ИдентификаторСеанса", "");
	ОписаниеПодключения.Вставить("ЗавершитьСеанс", Ложь);
	
	СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(НастройкиПодключения.АдресПриложения);
	
	ОписаниеПодключения.БазовыйURI = СтруктураАдреса.ПутьНаСервере;
	
	ЗащищенноеСоединение = Неопределено;
	Если ВРег(СтруктураАдреса.Схема) = "HTTPS" Тогда
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	КонецЕсли;
	
	ОписаниеПодключения.Соединение = Новый HTTPСоединение(
		СтруктураАдреса.Хост,
		СтруктураАдреса.Порт,
		,
		,
		ПолучениеФайловИзИнтернета.ПолучитьПрокси(СтруктураАдреса.Схема),
		Таймаут,
		ЗащищенноеСоединение);
	
	Если ЗначениеЗаполнено(НастройкиПодключения.ТокенДоступа) Тогда
		ОписаниеПодключения.СтрокаАутентификации = "Bearer " + НастройкиПодключения.ТокенДоступа;
	КонецЕсли;
	
	Возврат ОписаниеПодключения;
	
КонецФункции

Функция ВерсияИнтерфейса(ОписаниеПодключения) Экспорт
	
	ОписаниеЗапроса = НовыйЗапросКСервису(
		"/version",
		"GET");
	
	Ответ = ВыполнитьЗапросКСервису(ОписаниеПодключения, ОписаниеЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписатьОшибкуВызоваСервисаВЖурналРегистрации(ОписаниеЗапроса, Ответ.КодСостояния);
		Возврат Неопределено;
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	
	Возврат ОбщегоНазначения.JSONВЗначение(ТелоОтвета, , Ложь);
	
КонецФункции

Функция ПодготовитьСпискиИзмененийСинхронизируемыхОбъектов(ОписаниеПодключения, НастройкаОтражения) Экспорт
	
	ПроверитьИдентификаторСеанса(ОписаниеПодключения);
	
	КодНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаОтражения, "Код");
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("ИдентификаторНастройки", КодНастройки);
	
	ОписаниеЗапроса = НовыйЗапросКСервису(
		"/v1/change-records-snapshots",
		"POST",
		ОбщегоНазначения.ЗначениеВJSON(ДанныеЗапроса));
	ОписаниеЗапроса.Заголовки.Вставить("Content-Type", "application/json");
	
	Ответ = ВыполнитьЗапросКСервису(ОписаниеПодключения, ОписаниеЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписатьОшибкуВызоваСервисаВЖурналРегистрации(ОписаниеЗапроса, Ответ.КодСостояния);
		Возврат Неопределено;
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	
	Возврат ОбщегоНазначения.JSONВЗначение(ТелоОтвета, , Ложь);
	
КонецФункции

Функция ПолучитьИзмененияСинхронизируемыхОбъектов(ОписаниеПодключения, ИдентификаторСписка) Экспорт
	
	ПроверитьИдентификаторСеанса(ОписаниеПодключения);
	
	ОписаниеЗапроса = НовыйЗапросКСервису(
		СтрШаблон("/v1/change-records-snapshots/%1", ИдентификаторСписка),
		"GET");
	
	Ответ = ВыполнитьЗапросКСервису(ОписаниеПодключения, ОписаниеЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписатьОшибкуВызоваСервисаВЖурналРегистрации(ОписаниеЗапроса, Ответ.КодСостояния);
		Возврат Неопределено;
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	
	Возврат JSONВТаблицуЗначений(ТелоОтвета);
	
КонецФункции

Функция УдалитьРегистрациюИзмененийСинхронизируемыхОбъектов(ОписаниеПодключения, ИдентификаторСписка) Экспорт
	
	ПроверитьИдентификаторСеанса(ОписаниеПодключения);
	
	ОписаниеЗапроса = НовыйЗапросКСервису(
		СтрШаблон("/v1/change-records-snapshots/%1", ИдентификаторСписка),
		"DELETE");
	
	Ответ = ВыполнитьЗапросКСервису(ОписаниеПодключения, ОписаниеЗапроса);
	
	Если Ответ.КодСостояния <> 204 Тогда
		ЗаписатьОшибкуВызоваСервисаВЖурналРегистрации(ОписаниеЗапроса, Ответ.КодСостояния);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОтправитьДанныеПубличныхИдентификаторовБизнеса(ОписаниеПодключения, ДанныеИдентификаторов) Экспорт
	
	ПроверитьИдентификаторСеанса(ОписаниеПодключения);
	
	ОписаниеЗапроса = НовыйЗапросКСервису(
		"/v1/external-data",
		"POST",
		ТаблицаЗначенийВJSON(ДанныеИдентификаторов));
	ОписаниеЗапроса.Заголовки.Вставить("Content-Type", "application/json");
	
	Ответ = ВыполнитьЗапросКСервису(ОписаниеПодключения, ОписаниеЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписатьОшибкуВызоваСервисаВЖурналРегистрации(ОписаниеЗапроса, Ответ.КодСостояния);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьНастройкиПриложения(ОписаниеПодключения) Экспорт
	
	ПроверитьИдентификаторСеанса(ОписаниеПодключения);
	
	ОписаниеЗапроса = НовыйЗапросКСервису(
		"/v1/app-config",
		"GET");
	
	Ответ = ВыполнитьЗапросКСервису(ОписаниеПодключения, ОписаниеЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписатьОшибкуВызоваСервисаВЖурналРегистрации(ОписаниеЗапроса, Ответ.КодСостояния);
		Возврат Неопределено;
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	
	Возврат ОбщегоНазначения.JSONВЗначение(ТелоОтвета);
	
КонецФункции

Функция УстановитьНастройкиПриложения(ОписаниеПодключения, НастройкиПриложения) Экспорт
	
	ПроверитьИдентификаторСеанса(ОписаниеПодключения);
	
	ОписаниеЗапроса = НовыйЗапросКСервису(
		"/v1/app-config",
		"PUT",
		ОбщегоНазначения.ЗначениеВJSON(НастройкиПриложения));
	ОписаниеЗапроса.Заголовки.Вставить("Content-Type", "application/json");
	
	Ответ = ВыполнитьЗапросКСервису(ОписаниеПодключения, ОписаниеЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписатьОшибкуВызоваСервисаВЖурналРегистрации(ОписаниеЗапроса, Ответ.КодСостояния);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьНастройкиСовместногоИспользования(ОписаниеПодключения, НастройкаСсылка) Экспорт
	
	ПроверитьИдентификаторСеанса(ОписаниеПодключения);
	
	ИдентификаторНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаСсылка, "Код");
	
	ОписаниеЗапроса = НовыйЗапросКСервису(
		СтрШаблон("/v1/application-links/%1", ИдентификаторНастройки),
		"GET");
	
	Ответ = ВыполнитьЗапросКСервису(ОписаниеПодключения, ОписаниеЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписатьОшибкуВызоваСервисаВЖурналРегистрации(ОписаниеЗапроса, Ответ.КодСостояния);
		Возврат Неопределено;
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	
	Возврат ОбщегоНазначения.JSONВЗначение(ТелоОтвета);
	
КонецФункции

Функция УстановитьНастройкиСовместногоИспользования(ОписаниеПодключения, НастройкаСсылка, НастройкиСинхронизации) Экспорт
	
	ПроверитьИдентификаторСеанса(ОписаниеПодключения);
	
	ИдентификаторНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаСсылка, "Код");
	
	ОписаниеНастройки = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ОписаниеНастройки(НастройкаСсылка);
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("Идентификатор", ОписаниеНастройки.Идентификатор);
	ДанныеЗапроса.Вставить("ДатаНачалаОтражения", ОписаниеНастройки.ДатаНачалаОтражения);
	ДанныеЗапроса.Вставить("ОтражениеВключено", ОписаниеНастройки.ОтражениеВключено);
	
	ДанныеЗапроса.Вставить("Организации", Новый Массив);
	
	ТаблицаИдентификаторы = СовместноеИспользование.ПубличныеИдентификаторыСинхронизируемыхОбъектов(
		ОписаниеНастройки.УзелОбмена, ОписаниеНастройки.Организации);
	Для Каждого СтрокаИдентификаторы Из ТаблицаИдентификаторы Цикл
		ДанныеЗапроса.Организации.Добавить(СтрокаИдентификаторы.Идентификатор);
	КонецЦикла;
	
	ДанныеЗапроса.Вставить("РазделыУчета", ОбщегоНазначения.СкопироватьРекурсивно(ОписаниеНастройки.РазделыУчета));
	
	КодЭтогоУзла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.ЭтотУзел(), "Код");
	
	ДанныеЗапроса.Вставить("УзелОбмена", Новый Структура);
	ДанныеЗапроса.УзелОбмена.Вставить("Идентификатор", КодЭтогоУзла);
	ДанныеЗапроса.УзелОбмена.Вставить("ДатаНачалаВыгрузкиДокументов", ОписаниеНастройки.ДатаНачалаОтражения);
	
	Для Каждого КлючЗначение Из НастройкиСинхронизации Цикл
		ДанныеЗапроса.УзелОбмена.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	ОписаниеЗапроса = НовыйЗапросКСервису(
		СтрШаблон("/v1/application-links/%1", ИдентификаторНастройки),
		"PUT",
		ОбщегоНазначения.ЗначениеВJSON(ДанныеЗапроса));
	ОписаниеЗапроса.Заголовки.Вставить("Content-Type", "application/json");
	
	Ответ = ВыполнитьЗапросКСервису(ОписаниеПодключения, ОписаниеЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция НастроитьОрганизацию(ОписаниеПодключения, СведенияОбОрганизации) Экспорт
	
	ПроверитьИдентификаторСеанса(ОписаниеПодключения);
	
	ОписаниеЗапроса = НовыйЗапросКСервису(
		"/v1/setup-organization",
		"PUT",
		ОбщегоНазначения.ЗначениеВJSON(СведенияОбОрганизации));
	ОписаниеЗапроса.Заголовки.Вставить("Content-Type", "application/json");
	
	Ответ = ВыполнитьЗапросКСервису(ОписаниеПодключения, ОписаниеЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписатьОшибкуВызоваСервисаВЖурналРегистрации(ОписаниеЗапроса, Ответ.КодСостояния);
		Возврат Неопределено;
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	
	Возврат ОбщегоНазначения.JSONВЗначение(ТелоОтвета, , Ложь);
	
КонецФункции

Функция УчетнаяПолитикаОрганизации(ОписаниеПодключения, Идентификатор, Период) Экспорт
	
	ПроверитьИдентификаторСеанса(ОписаниеПодключения);
	
	ОписаниеЗапроса = НовыйЗапросКСервису(
		СтрШаблон("/v1/accounting-policy?company-id=%1&date=%2", Идентификатор, XMLСтрока(Период)),
		"GET");
	
	Ответ = ВыполнитьЗапросКСервису(ОписаниеПодключения, ОписаниеЗапроса);
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	
	Возврат ОбщегоНазначения.JSONВЗначение(ТелоОтвета);
	
КонецФункции

Процедура ЗавершитьСеанс(ОписаниеПодключения) Экспорт
	
	ОписаниеПодключения.ЗавершитьСеанс = Истина;
	ВерсияИнтерфейса(ОписаниеПодключения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НастройкиПодключения(Пользователь)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиИнтеграции.АдресПриложения КАК АдресПриложения,
	|	НастройкиИнтеграции.НомерОбласти КАК НомерОбласти
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииСБухгалтерией КАК НастройкиИнтеграции
	|ГДЕ
	|	НастройкиИнтеграции.Использование");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура("АдресПриложения,НомерОбласти,ТокенДоступа");
	
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Попытка
		ДействующийТокен = ПрограммныйИнтерфейсСервиса.ДействующийТокенДоступа(Пользователь);
	Исключение
		ДействующийТокен = "";
	КонецПопытки;
	
	Результат.ТокенДоступа = ДействующийТокен;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйЗапросКСервису(АдресРесурса, Метод = "GET", ТелоЗапроса = "")
	
	ОписаниеЗапроса = Новый Структура;
	ОписаниеЗапроса.Вставить("АдресРесурса", АдресРесурса);
	ОписаниеЗапроса.Вставить("Метод", Метод);
	ОписаниеЗапроса.Вставить("ТелоЗапроса", ТелоЗапроса);
	ОписаниеЗапроса.Вставить("Заголовки", Новый Соответствие);
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

Функция ВыполнитьЗапросКСервису(ОписаниеПодключения, ОписаниеЗапроса)
	
	ПолныйАдресРесурса = СтрШаблон("/%1/hs/%2/%3", ОписаниеПодключения.БазовыйURI, КорневойURLСервиса(), ОписаниеЗапроса.АдресРесурса);
	
	Запрос = Новый HTTPЗапрос(ПолныйАдресРесурса);
	
	Для Каждого КлючЗначение Из ОписаниеЗапроса.Заголовки Цикл
		Запрос.Заголовки.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Если Не ПустаяСтрока(ОписаниеПодключения.СтрокаАутентификации) Тогда
		Запрос.Заголовки.Вставить("Authorization", ОписаниеПодключения.СтрокаАутентификации);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ОписаниеПодключения.ИдентификаторСеанса) Тогда
		Запрос.Заголовки.Вставить("Cookie", ОписаниеПодключения.ИдентификаторСеанса);
		
		Если ОписаниеПодключения.ЗавершитьСеанс Тогда
			Запрос.Заголовки.Вставить("IBSession", "finish");
		КонецЕсли;
	Иначе
		Запрос.Заголовки.Вставить("IBSession", "start");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ОписаниеЗапроса.ТелоЗапроса) Тогда
		Запрос.УстановитьТелоИзСтроки(ОписаниеЗапроса.ТелоЗапроса);
	КонецЕсли;
	
	Ответ = ОписаниеПодключения.Соединение.ВызватьHTTPМетод(ОписаниеЗапроса.Метод, Запрос);
	
	КукиОтвета = Ответ.Заголовки.Получить("Set-Cookie");
	Если ЗначениеЗаполнено(КукиОтвета) Тогда
		ОписаниеПодключения.ИдентификаторСеанса = КукиОтвета;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Процедура ПроверитьИдентификаторСеанса(ОписаниеПодключения)
	
	Если Не ЗначениеЗаполнено(ОписаниеПодключения.ИдентификаторСеанса) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВерсияИнтерфейса(ОписаниеПодключения) = Неопределено Тогда
		ОписаниеПодключения.ИдентификаторСеанса = "";
	КонецЕсли;
	
КонецПроцедуры

Функция JSONВТаблицуЗначений(СтрокаJSON)
	
	СтруктураДанные = ОбщегоНазначения.JSONВЗначение(СтрокаJSON, , Ложь);
	
	ИменаКолонок = Новый Массив;
	ТипыКолонок = Новый Структура;
	
	Для Каждого ОписаниеКолонки Из СтруктураДанные.Колонки Цикл
		КолонкаТип = СтрРазделить(ОписаниеКолонки, ":", Ложь);
		ИменаКолонок.Добавить(КолонкаТип[0]);
		Если КолонкаТип.Количество() > 1 Тогда
			ТипыКолонок.Вставить(КолонкаТип[0], КолонкаТип[1]);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДанные = Новый ТаблицаЗначений;
	Для Каждого ИмяКолонки Из ИменаКолонок Цикл
		ТипКолонки = Неопределено;
		Если ТипыКолонок.Свойство(ИмяКолонки, ТипКолонки) Тогда
			ТаблицаДанные.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов(ТипКолонки));
		Иначе
			ТаблицаДанные.Колонки.Добавить(ИмяКолонки);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДанные Из СтруктураДанные.Строки Цикл
		НоваяСтрока = ТаблицаДанные.Добавить();
		Для Инд = 0 По ИменаКолонок.ВГраница() Цикл
			ИмяКолонки = ИменаКолонок[Инд];
			ТипКолонки = Неопределено;
			Если ТипыКолонок.Свойство(ИмяКолонки, ТипКолонки) Тогда
				НоваяСтрока[ИмяКолонки] = XMLЗначение(Тип(ТипКолонки), СтрокаДанные[Инд]);
			Иначе
				НоваяСтрока[ИмяКолонки] = СтрокаДанные[Инд];
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаДанные;
	
КонецФункции

Функция ТаблицаЗначенийВJSON(ТаблицаДанные, ТипизацияКолонок = "")
	
	ТипыКолонок = Новый Структура;
	Если Не ПустаяСтрока(ТипизацияКолонок) Тогда
		Для Каждого ОписаниеКолонки Из СтрРазделить(ТипизацияКолонок, ",", Ложь) Цикл
			КолонкаТип = СтрРазделить(ОписаниеКолонки, ":");
			ТипыКолонок.Вставить(КолонкаТип[0], КолонкаТип[1]);
		КонецЦикла;
	КонецЕсли;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Колонки", Новый Массив);
	СтруктураДанные.Вставить("Строки", Новый Массив);
	
	ИменаКолонок = Новый Массив;
	Для Каждого Колонка Из ТаблицаДанные.Колонки Цикл
		ИменаКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Для Каждого ИмяКолонки Из ИменаКолонок Цикл
		ТипКолонки = Неопределено;
		Если ТипыКолонок.Свойство(ИмяКолонки, ТипКолонки) Тогда
			СтруктураДанные.Колонки.Добавить(ИмяКолонки + ":" + ТипКолонки);
		Иначе
			СтруктураДанные.Колонки.Добавить(ИмяКолонки);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДанные Из ТаблицаДанные Цикл
		ДанныеСтроки = Новый Массив;
		Для Каждого ИмяКолонки Из ИменаКолонок Цикл
			ДанныеСтроки.Добавить(СтрокаДанные[ИмяКолонки]);
		КонецЦикла;
		СтруктураДанные.Строки.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ЗначениеВJSON(СтруктураДанные);
	
КонецФункции

Процедура ЗаписатьОшибкуВызоваСервисаВЖурналРегистрации(ОписаниеЗапроса, КодСостояния)
	
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Ошибка выполнения запроса %1. Код возврата: %2.'"),
		ОписаниеЗапроса.Метод + " " + ОписаниеЗапроса.АдресРесурса,
		КодСостояния);
	
	ЗаписьЖурналаРегистрации(
		СобытиеЖурналаРегистрацииСервисСовместногоИспользования(),
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ТекстОшибки);
	
КонецПроцедуры

Функция СобытиеЖурналаРегистрацииСервисСовместногоИспользования()
	
	Возврат НСтр("ru = 'Совместное использование.Сервис совместного использования'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Функция КорневойURLСервиса()
	
	Возврат "cooperation";
	
КонецФункции

#КонецОбласти
